[
	"What’s most exciting to you about Palantir’s offerings and why do you want to work here?":"I wish to work at Palantir because of the diverse breath of opportunities that are present in the company. From my research, I understand that Palantir has a hand in pharmaceuticals, real time systems, defense and much more. I want to work here because I believe that Palantir will give me the opportunity to apply my skills in many different fields. I believe working in Palantir will give me a diverse set of experiences. I also really like that I'll be working in small teams - from my prior working experience I understand these are the best types of environments to work in when building software. Since I'm a new grad, I really want this experience to expand my breath of abilities and apply myself as much as possible. "
	"If you could solve any problem that impacts your daily life, what would it be and how would you solve it?" : "One constant nagging problem I have in my life is train delays. Today for example, in Penn Station in NYC - the LIRR tracks are announced at the very last minute. Often they are announced 2 to 3 minutes before departure, making entering the train a race. I would fix this by fixing internal signaling in the train station's tunnels and making better software to track where each train is coming and going from. It is clear there is aging tech and infrastructure, and they need to be updated to the present. Train infrastructure, like code - needs to be maintained and updated to uphold best practices. "
	"Tell us one thing that’s not on your resume that you’re proud of." : "I'm really proud of how quickly I pick up on and apply new skills. I recently started a class in which I had to learn how to SSH into a server and run CUDA code. I applied this skill to host and set up my own apache web server on a discarded laptop. It's accessible via IP and I'm working on getting a domain for the server. It's so cool what you can do on unix environments, I love doing stuff like this that pushes my limits and expands my perspective and scope on software."
]
